#+INCLUDE: /home/ttt/.templates/NoteConfig.org
#+TITLE: Function
#+Author:
#+Email:
#+DATE:  2018-11-21
** Examples
当数组作为形参时是需要特别强调的，因为数组不允许拷贝所以不能使用传值传递，因为数
组名会转变为指向头元素的指针，所以当我们为函数传递一个数组时，实际传递的是一个指
针。因此下面三个函数是等价的：
#+BEGIN_SRC C++ -n -r :exports both :results value verbatim
void print(const int*);
void print(const int []);
void print(const int[10]); //这里的维度是我们期望的，实际不一定
#+END_SRC
因为数组是以指针的形式传递给函数的，因此必须还要向函数提供数组的维度信息，可以使
用如下的方法：
1. 使用标准库规范
使用标准库中的 =std::begin()= 和 =std::end()= 获得数组的首迭代器和尾后迭代器，将
这两个迭代器传入函数。
#+BEGIN_SRC C++ -n -r :exports both :results value verbatim
  int j[2]{1,2};
  void print(int* beg,int*end)
  {
      while(beg != end)
      {
          cout << *beg++ << endl;
      }
  }
print(begin(j),end(j));
#+END_SRC
2. 显式传递一个表示数组大小的形参
在C 程序和过去的C++语言中常用这种方法。


下面是一个利用数组的引用避免数组作为形参会退化为指针的例子：
#+BEGIN_SRC C++ -n -r :exports both :results value verbatim
  #include <iostream>

  // Note: You need to specify the array size in the function declaration
  void printElements(int (&arr)[4])
  {
    int length{ sizeof(arr) / sizeof(arr[0]) }; // we can now do this since the array won't decay

    for (int i{ 0 }; i < length; ++i)
    {
      std::cout << arr[i] << " ";
    }
  }

  int main()
  {
      int arr[]{ 99, 20, 14, 80 };

      printElements(arr);

      return 0;
  }
#+END_SRC

#+RESULTS:
: 99 20 14 80

上面的例子缺点是只能传递固定维度的数组，如果想要传递任意维度的数组可以使用函数模
板。
*传递多维数组*
和所有数组一样，当传递多维数组时真正传递的是指向首元素的指针，因为我们传递的是数
组的数组，所以首元素本身就是一个数组，指针就是 _一个指向数组的指针_ 。数组第二维(以
及后面的所有维)的大小都是数组类型的一部分，不能省略。因此下面的函数是等价的：
#+BEGIN_SRC C++ -n -r :exports both :results value verbatim
void print(int (*matrix)[10],size_t row);
void print(int matrix[][10],size_t row);
#+END_SRC

* 函数指针
由于函数在程序内存中也是有地址的，因此我们可以定义函数指针指向函数。 *函数的类型由
它的返回类型和形参类型共同决定，与函数名无关*  在指向不同函数类型的指针间不存在转
换规则，但是当函数指针不指向任何函数时我们可以给它赋值 =nullptr=.

#+BEGIN_SRC C++ -n -r :exports both :results value verbatim
  #include <iostream>
  #include <string>
  #include <functional> //std::function
  void print(const std::string& str)
  {
      std::cout << str << "\n";
  }

  //1 直接使用函数类型定义函数指针
  void (*pf)(const std::string&);
  void (*const cpf)(const std::string&) = print;

  //2 为函数类型取别名，可以直接用别名定义函数指针，并指向正确的函数，方便书写和理解
  //2.1 获得函数指针， PT是一个指向函数的指针
  // typedef void (*PT) (const std::string& str);
  // using PT = void (*)(const std::string&);
  //2.2 获得函数类型， P 是一个函数类型
  //  typedef void P(const std::string&);
  //  using P = void(const std::string&);
  //3 通过decltype关键字获取函数类型，并为其取别名
  // typedef decltype(print) *PT;
  using PT = decltype(print)*;

  int main(int argc, char *argv[])
  {
      cpf("This is cpf!");
      pf = print;
      pf("This is pf!");
      PT pt;
      pt = print;
      pt("THis is pt");
  //直接使用decltype 定义函数指针
      decltype(print) *dpt;
      dpt = print;
      dpt("THis is dpt!");
  //使用std::function
      std::function<void(const std::string&)> fpf;
      fpf = print;
      fpf("This is fpf!");
  }
#+END_SRC

#+RESULTS:
: This is cpf!
: This is pf!
: THis is pt
: THis is dpt!
: This is fpf!
函数 ~print~ 的类型是 =void(const std::string&)=,类似于普通的数据类型，比如 =double=,
对于这样一个简单的函数，每次写函数类型还是可以接受的，毕竟不算太麻烦，但如果一个
具有复杂返回类型和形参列表的函数，每次都写完整的类型不仅写起来麻烦，而且不容易理
解，最重要的是很容易出错，因此我们可以用以下方法来简化函数类型：
+ 类型别名 :: 使用 =typedef= 或者 =using= 来为函数类型取别名。
+ decltype :: 在C++11中可以使用 =decltype= 关键字获取某个函数的类型。
+ std::function :: 在C++11中还可以使用 =std::function= 方法来定义和存储函数指针
** 函数指针形参
我们应该在心理有这样一个概念，将函数与对象对应起来：函数类型对应数据类型，函数名
对应对象名。既然我们能把数据类型作为函数形参，那么也能把函数类型作为另一个函数的
形参，我们把这样的函数叫做回调函数 (callback funciton).函数指针形参也可以有默认
值。下面以一个排序算法的改进来说明回调函数的用法：
#+BEGIN_SRC C++ -n -r :exports both :results value verbatim
  #include <algorithm> // for std::swap, use <utility> instead if C++11
  #include <iostream>
  void SelectionSort(int *array, int size)
  {
      // Step through each element of the array
      for (int startIndex = 0; startIndex < size; ++startIndex)
      {
          // smallestIndex is the index of the smallest element we've encountered so far.
          int smallestIndex = startIndex;

          // Look for smallest element remaining in the array (starting at startIndex+1)
          for (int currentIndex = startIndex + 1; currentIndex < size; ++currentIndex)
          {
              // If the current element is smaller than our previously found smallest
              if (array[smallestIndex] > array[currentIndex]) // COMPARISON DONE HERE
                  // This is the new smallest number for this iteration
                  smallestIndex = currentIndex;
          }

          // Swap our start element with our smallest element
          std::swap(array[startIndex], array[smallestIndex]);
      }
  }
  // This function prints out the values in the array
  void printArray(int *array, int size)
  {
      for (int index=0; index < size; ++index)
          std::cout << array[index] << " ";
      std::cout << '\n';
  }

  int main(int argc, char *argv[])
  {
      int array[9] = { 3, 7, 9, 5, 6, 1, 8, 2, 4 };
      SelectionSort(array, 9);
      printArray(array,9);
      return 0;
  }
#+END_SRC

#+RESULTS:
: 1 2 3 4 5 6 7 8 9
本例的 =SelectionSort= 函数只有一个功能，就是按递增的方式对数组排序，如果我们想
要一个按递减方式对数组排序的函数那就只能重新写一个递减的版本，当我们使用了函数指
针以后，我们可以不必重新写 =SelectionSort= 函数，而只要改变比较的方式即可。思路
就是写一个比较函数(递增或递减),然后将比较函数传入 =SelectionSort=,替换掉原函数中
的比较语句，这样我们就可以使用自己版本的比较函数，我们甚至还可以写更多的比较函数
传入排序函数中，这样大大增大了代码的灵活性和可重用性。
#+BEGIN_SRC C++ -n -r :exports both :results value verbatim
#include <algorithm> // for std::swap, use <utility> instead if C++11
#include <iostream>

// Note our user-defined comparison is the third parameter
void selectionSort(int *array, int size, bool (*comparisonFcn)(int, int))
{
    // Step through each element of the array
    for (int startIndex = 0; startIndex < size; ++startIndex)
    {
        // bestIndex is the index of the smallest/largest element we've encountered so far.
        int bestIndex = startIndex;

        // Look for smallest/largest element remaining in the array (starting at startIndex+1)
        for (int currentIndex = startIndex + 1; currentIndex < size; ++currentIndex)
        {
            // If the current element is smaller/larger than our previously found smallest
            if (comparisonFcn(array[bestIndex], array[currentIndex])) // COMPARISON DONE HERE
                // This is the new smallest/largest number for this iteration
                bestIndex = currentIndex;
        }

        // Swap our start element with our smallest/largest element
        std::swap(array[startIndex], array[bestIndex]);
    }
}

// Here is a comparison function that sorts in ascending order
// (Note: it's exactly the same as the previous ascending() function)
bool ascending(int x, int y)
{
    return x > y; // swap if the first element is greater than the second
}

// Here is a comparison function that sorts in descending order
bool descending(int x, int y)
{
    return x < y; // swap if the second element is greater than the first
}

// This function prints out the values in the array
void printArray(int *array, int size)
{
    for (int index=0; index < size; ++index)
        std::cout << array[index] << " ";
    std::cout << '\n';
}

int main()
{
    int array[9] = { 3, 7, 9, 5, 6, 1, 8, 2, 4 };

    // Sort the array in descending order using the descending() function
    selectionSort(array, 9, descending);
    printArray(array, 9);

    // Sort the array in ascending order using the ascending() function
    selectionSort(array, 9, ascending);
    printArray(array, 9);

    return 0;
}
#+END_SRC

#+RESULTS:
: 9 8 7 6 5 4 3 2 1
: 1 2 3 4 5 6 7 8 9

